In [1]:
import pandas as pd

In [3]:
x = pd.DataFrame({
    'Roll No': [101, 102, 103, 104],
    'Name': ['Raj', 'Raman', 'Mohan', 'Tushar']
})

print(x)

   Roll No    Name
0      101     Raj
1      102   Raman
2      103   Mohan
3      104  Tushar

In [6]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll No  4 non-null      int64
 1   Name     4 non-null      object
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [7]:
x.isnull()

   Roll No   Name
0    False  False
1    False  False
2    False  False
3    False  False

In [8]:
x.describe()

          Roll No
count    4.000000
mean   102.500000
std      1.290994
min    101.000000
25%    101.750000
50%    102.500000
75%    103.250000
max    104.000000

In [9]:
x.head()

   Roll No    Name
0      101     Raj
1      102   Raman
2      103   Mohan
3      104  Tushar

In [23]:
x = pd.DataFrame(
    [[1, 2, 3, 4, 5],
     [6, 7, 8, 9, 10]],
    index=[1, 2],
    columns=['a', 'b', 'c', 'd', 'e']
)

print(x)

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [24]:
x.dropna()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [25]:
x.tail()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10